{
  "site": {
    "title": "A Luz nas Trevas – A História de Jesus Cristo",
    "theme": "dark-biblical",
    "author": "Nelson dos Santos Walcow",
    "language": "pt-BR",
    "version": "1.0",
    "description": "Uma jornada pela vida, morte e ressurreição de Jesus Cristo, contada à luz das Escrituras, com reflexões espirituais para os dias atuais."
  },
  "workflow": {
    "mode": "offline",
    "architecture": "darksite",
    "data_source": "local_json",
    "generation_pipeline": [
      "carregar_json",
      "renderizar_html_estático",
      "adicionar_tema_dark",
      "publicar_offline"
    ]
  },
  "timeline": [
    {
      "id": 1,
      "titulo": "O Nascimento Prometido",
      "referencia_biblica": "Lucas 2:1-20",
      "descricao": "Em Belém, sob o brilho de uma estrela, nasce Jesus, o Filho de Deus. Anjos anunciam paz e boa vontade aos homens.",
      "mensagem": "Mesmo nas trevas do mundo, Deus faz nascer a luz da esperança.",
      "reflexao_atual": "Nos tempos de incerteza e frieza espiritual, a fé renasce quando acolhemos o amor de Cristo."
    },
    {
      "id": 2,
      "titulo": "O Chamado no Deserto",
      "referencia_biblica": "Mateus 3:13-17",
      "descricao": "Jesus é batizado por João Batista no rio Jordão. O Espírito Santo desce sobre Ele em forma de pomba.",
      "mensagem": "Quem se entrega a Deus encontra direção e propósito.",
      "reflexao_atual": "Assim como Jesus foi ungido, cada um de nós é chamado a cumprir uma missão divina."
    },
    {
      "id": 3,
      "titulo": "As Tentações e a Vitória",
      "referencia_biblica": "Mateus 4:1-11",
      "descricao": "No deserto, Jesus é tentado por Satanás, mas vence pela Palavra de Deus.",
      "mensagem": "A verdadeira força não vem do pão, mas da fé e obediência a Deus.",
      "reflexao_atual": "Em um mundo digital tentador, precisamos do discernimento espiritual para resistir às falsas promessas."
    },
    {
      "id": 4,
      "titulo": "Os Milagres e o Ministério",
      "referencia_biblica": "Mateus 8–9, João 11",
      "descricao": "Jesus cura enfermos, liberta oprimidos e até ressuscita mortos, revelando o poder do Reino de Deus.",
      "mensagem": "Onde há fé, o impossível se torna possível.",
      "reflexao_atual": "A cura de hoje pode vir em forma de paz interior e transformação espiritual."
    },
    {
      "id": 5,
      "titulo": "O Sermão da Montanha",
      "referencia_biblica": "Mateus 5–7",
      "descricao": "Jesus ensina as bem-aventuranças e revela o caminho da verdadeira justiça e amor.",
      "mensagem": "Bem-aventurados os puros de coração, porque verão a Deus.",
      "reflexao_atual": "O mundo moderno precisa redescobrir o valor da humildade, misericórdia e perdão."
    },
    {
      "id": 6,
      "titulo": "A Última Ceia",
      "referencia_biblica": "Lucas 22:14-20",
      "descricao": "Jesus parte o pão e o vinho, selando o novo pacto de salvação.",
      "mensagem": "O amor supremo é o que se doa em favor do outro.",
      "reflexao_atual": "Cada refeição pode se tornar um ato de comunhão e gratidão, mesmo nos dias de escassez."
    },
    {
      "id": 7,
      "titulo": "A Crucificação",
      "referencia_biblica": "Mateus 27:32-56",
      "descricao": "Jesus é crucificado no Gólgota. O véu do templo se rasga, e a redenção é consumada.",
      "mensagem": "O sacrifício de Cristo é o ponto máximo do amor divino.",
      "reflexao_atual": "Na dor, há redenção; na entrega, há vitória eterna."
    },
    {
      "id": 8,
      "titulo": "A Ressurreição",
      "referencia_biblica": "Mateus 28:1-10",
      "descricao": "Ao terceiro dia, Jesus ressuscita, vencendo a morte e trazendo vida eterna.",
      "mensagem": "Ele vive! A esperança não morreu.",
      "reflexao_atual": "Mesmo nas ruínas da fé humana, Deus pode ressuscitar sonhos e propósitos."
    },
    {
      "id": 9,
      "titulo": "A Grande Comissão",
      "referencia_biblica": "Mateus 28:18-20",
      "descricao": "Jesus envia seus discípulos a pregar o Evangelho a todas as nações.",
      "mensagem": "Ide por todo o mundo e pregai o Evangelho.",
      "reflexao_atual": "Hoje, o mundo digital é o novo campo missionário — e cada post pode ser uma semente de fé."
    },
    {
      "id": 10,
      "titulo": "A Promessa da Volta",
      "referencia_biblica": "Atos 1:9-11",
      "descricao": "Jesus ascende aos céus e promete voltar para buscar os que O amam.",
      "mensagem": "O fim não é destruição, mas restauração.",
      "reflexao_atual": "Enquanto o mundo se prepara para o caos, os fiéis se preparam para o retorno do Rei."
    }
  ],
  "meta": {
    "final_message": "Jesus Cristo é o mesmo ontem, hoje e eternamente (Hebreus 13:8).",
    "tags": ["Jesus", "fé", "profecia", "esperança", "Evangelho", "escatologia", "salvação"],
    "source": "Sagradas Escrituras"
  }
}